/*
 Задача:
 Реализовать ежедневник.
 Каждая запись ежедневника содержит в себе следующую информацию:
 
 Дата создания
 Заголовок
 Текст
 
 Функции ежедневника:
 Добавить новую запись
 Получить список всех записей
 Прочитать запись по индексу
 
 */



Console.WriteLine("Hello, World!");